# Задача 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.    
# Пример:    
# 6782 -> 23
# 0,56 -> 11

userNum = float(input("Введите число: "))
print(userNum)

def DigitSum(userNum):
    sum = 0
    i = 1
    #нужно будет попробовать через while

print ("Сумма цифр введённого числа равняется: " DigitSum)