""" Задача 1. Вычислить число c заданной точностью d    
Пример:    
при d = 0.001, π = 3.141    10^(-1) ≤ d ≤10^(-10)
"""

from cmath import pi 
import numpy

d = numpy.pi
print("Число Пи = ", d)
print()

# попробовать через while или for сократить
